DMSurya/Nisense_Surya/NiSense-main/drivers/sensor/max32664/max32664_raw.c
/**
 * @file max32664_raw.c
 * @brief MAX32664 RAW Mode - Hub reads sensors, outputs raw ADC via output FIFO
 *
 * RAW mode: Hub firmware reads MAX86141 FIFO internally (proper multi-byte
 * I2C/SPI) and outputs raw sensor data through the hub's output FIFO
 * (Family 0x12). Sensor register configuration uses hub passthrough commands
 * (Family 0x40/0x41) with transparent wrapper functions from max86141_regs.h
 * and lis2ds12_regs.h.
 *
 * The nRF52840 runs the ppg_algo subsystem to compute HR/SpO2 from the raw
 * PPG ADC values.
 *
 * For PASSTHROUGH mode (hub as bridge, MAX86141 FIFO via burst read for tests),
 * see max32664_passthrough.c — do not use that AFE path from this file.
 *
 * Architecture (RAW Mode):
 * ┌─────────────────────────────────────────────────────────────────┐
 * │                    MAX32664 Sensor Hub                          │
 * │   ┌───────────┐              ┌───────────┐                     │
 * │   │ MAX86141  │ ◄──SPI────── │ LIS2DS12  │                     │
 * │   │  PPG AFE  │              │  Accel    │                     │
 * │   └─────┬─────┘              └─────┬─────┘                     │
 * │         │                          │                            │
 * │         └──────────┬───────────────┘                            │
 * │                    │                                            │
 * │         ┌──────────▼──────────┐                                 │
 * │         │  Hub Firmware       │ ◄── OUTPUT_MODE_SENSOR_DATA    │
 * │         │  Reads FIFO data    │     (0x01): raw ADC output     │
 * │         │  (multi-byte I2C)   │                                 │
 * │         └──────────┬──────────┘                                 │
 * │                    │ Output FIFO (Family 0x12)                  │
 * └────────────────────┼────────────────────────────────────────────┘
 *                      │ I2C (0x55)
 *                      ▼
 *               ┌──────────────┐
 *               │   nRF52840   │
 *               │              │
 *               │ ┌──────────┐ │
 *               │ │ PPG Algo │ │ ◄── On-chip HR/SpO2 processing
 *               │ └──────────┘ │
 *               └──────────────┘
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT maxim_max32664

#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/sensor.h>
#include <zephyr/logging/log.h>
#include <string.h>

#include "max32664.h"
#include "max32664_priv.h"
#include "max86141_regs.h"
#include "max86141_green.h"
#include "lis2ds12_regs.h"

#if defined(CONFIG_CALIBRATION)
#include "calibration.h"
#endif

LOG_MODULE_DECLARE(max32664, CONFIG_SENSOR_LOG_LEVEL);

/* LIS2DS12 @ 25 Hz, ±2 g, BDU=1 — matches max32664c host-feed path (GWEC 30.2.x). */
static int raw_lis2ds12_prepare_host_feed(const struct device *dev)
{
	uint8_t whoami;
	int ret;

	ret = lis2ds12_read_reg(dev, LIS2DS12_REG_WHO_AM_I, &whoami);
	if (ret) {
		LOG_ERR("External accel: LIS2DS12 WHOAMI read failed: %d", ret);
		return ret;
	}
	if (whoami != LIS2DS12_WHOAMI_VALUE && whoami != LIS2DS12_WHOAMI_ALT) {
		LOG_WRN("External accel: unexpected WHOAMI 0x%02x (expected 0x43/0x1D)",
			whoami);
	} else {
		LOG_INF("External accel: LIS2DS12 WHOAMI=0x%02x via passthrough", whoami);
	}

	uint8_t ctrl1 = (LIS2DS12_ODR_25HZ << LIS2DS12_ODR_POS) |
		       (LIS2DS12_FS_2G << LIS2DS12_FS_POS) |
		       (1U << LIS2DS12_BDU_POS);

	ret = lis2ds12_write_reg(dev, LIS2DS12_REG_CTRL1, ctrl1);
	if (ret) {
		LOG_ERR("External accel: CTRL1 write failed: %d", ret);
		return ret;
	}
	ret = lis2ds12_write_reg(dev, LIS2DS12_REG_CTRL2, 0x00);
	if (ret) {
		LOG_WRN("External accel: CTRL2 write failed: %d (continuing)", ret);
	}

	LOG_INF("External accel: LIS2DS12 prepared @ 25 Hz, ±2 g, BDU=1");
	return 0;
}

/* ============================================================================
 * RAW Mode State
 * ============================================================================ */

/** RAW mode specific data stored in max32664_data */
struct max32664_raw_state {
	bool ppg_enabled;
	bool accel_enabled;
	uint8_t ppg_sample_rate;    /* Hz */
	uint8_t ppg_led_current[3]; /* IR, Red, Green (mA) */
	int16_t accel_x, accel_y, accel_z; /* Last accel readings (milli-g) */
	uint32_t ppg_ir, ppg_red, ppg_green; /* Last PPG readings */
};

void max32664_raw_reset_session_state(const struct device *dev)
{
	struct max32664_data *data = dev->data;

	if (!data) {
		return;
	}

	memset(&data->raw_runtime, 0, sizeof(data->raw_runtime));
	data->raw_runtime.settle_discard_left =
		(uint16_t)CONFIG_MAX32664_RAW_SETTLE_DISCARD_SAMPLES;
	LOG_INF("RAW session state reset (settle discard %u samples @ ~25 Hz)",
		data->raw_runtime.settle_discard_left);
}

/* ============================================================================
 * RAW Mode Initialization
 * ============================================================================ */

/**
 * @brief Initialize MAX32664 in RAW mode
 *
 * This puts the hub in OUTPUT_MODE_PAUSE and enables passthrough access
 * to the underlying MAX86141 and LIS2DS12 sensors.
 *
 * @param dev MAX32664 device
 * @return 0 on success, negative error code on failure
 */
int max32664_raw_mode_init(const struct device *dev)
{
	struct max32664_data *data = dev->data;
	const struct max32664_config *cfg = dev->config;
	int ret;
	uint8_t rx[1];

	LOG_INF("=== Initializing MAX32664 RAW Mode ===");
	max32664_raw_reset_session_state(dev);

	/* Verify we have the right hardware (GWEC variant with MAX86141 + LIS2DS12) */
	if (data->variant != MAX32664_VARIANT_C &&
	    data->variant != MAX32664_VARIANT_B) {
		LOG_ERR("RAW mode requires GWEC variant (B or C), detected: %d", 
			data->variant);
		return -ENOTSUP;
	}

	/* Verify AFE is MAX86141 */
	if (data->afe_whoami != 0x25 && data->afe_whoami != 0x36) {
		LOG_ERR("RAW mode requires MAX86141 AFE (0x25), got: 0x%02X",
			data->afe_whoami);
		return -ENOTSUP;
	}

	/* Variant C WHRM: accelerometer is mandatory (AN6924 / AlgoHub). */
	if (data->variant == MAX32664_VARIANT_C) {
		bool whoami_ok = (data->accel_whoami == 0x43 || data->accel_whoami == 0x1D);
		bool feeder_ok = cfg->accel_external &&
				 IS_ENABLED(CONFIG_MAX32664_EXTERNAL_ACCEL_FEEDER);

		if (!whoami_ok && !feeder_ok) {
			LOG_ERR("Variant C requires accelerometer (WHOAMI=0x%02X) or "
				"accel-source=external + EXTERNAL_ACCEL_FEEDER",
				data->accel_whoami);
			return -ENODEV;
		}
		if (!whoami_ok && feeder_ok) {
			LOG_WRN("Variant C: accel WHOAMI missing; relying on external feeder");
		}
	} else if (data->accel_whoami != 0x43 && data->accel_whoami != 0x1D) {
		LOG_WRN("No accelerometer detected (WHOAMI: 0x%02X), motion rejection disabled",
			data->accel_whoami);
	}

	LOG_INF("RAW Mode: MAX86141 (0x%02X) + LIS2DS12 (0x%02X)",
		data->afe_whoami, data->accel_whoami);

