DMSurya/Nisense_Surya/NiSense-main/drivers/sensor/max32664/max32664_raw.c
	/* Stop any running algorithms and put hub in PAUSE mode */
	ret = max32664_stop_algorithms_and_sensors(dev);
	if (ret) {
		LOG_ERR("Failed to stop hub algorithms: %d", ret);
		return ret;
	}

	/* Per Maxim UG Table 14: Enable Sensor uses **4** bytes; last byte selects
	 * data source (0x00 = hub-side, 0x01 = host-fed WRITE_INPUT / 0x14).
	 * GWEC 30.2.x does not auto-poll LIS2DS12 — boards with accel-source=external
	 * in DT must use 0x44 0x04 0x01 0x01 plus CONFIG_MAX32664_EXTERNAL_ACCEL_FEEDER
	 * or Family 0x12 stays empty while output mode is 0x01.
	 */
	uint8_t tx4[4];

	tx4[0] = 0x44;
	tx4[1] = HUB_SENSOR_IDX_MAX86141;
	tx4[2] = 0x01;
	tx4[3] = 0x00; /* hub-side PPG */
	LOG_DBG("Enabling MAX86141 (0x44 00 01 00)...");
	ret = max32664_i2c_transmit_retry(dev, tx4, sizeof(tx4), rx, 1, 100, 3);
	if (ret || rx[0] != MAX32664_STATUS_SUCCESS) {
		LOG_ERR("Failed to enable MAX86141: ret=%d, status=0x%02X", ret, rx[0]);
		return ret ? ret : -EIO;
	}
	k_msleep(50);

	if (cfg->accel_external) {
#if !IS_ENABLED(CONFIG_MAX32664_EXTERNAL_ACCEL_FEEDER)
		if (data->variant == MAX32664_VARIANT_C) {
			LOG_ERR("Variant C + accel-source=external requires "
				"CONFIG_MAX32664_EXTERNAL_ACCEL_FEEDER");
			return -ENODEV;
		}
		LOG_WRN("DT accel-source=external but CONFIG_MAX32664_EXTERNAL_ACCEL_FEEDER "
			"is disabled — enable it in prj.conf or hub output FIFO may stay empty");
#endif
		ret = raw_lis2ds12_prepare_host_feed(dev);
		if (ret) {
			LOG_WRN("External LIS2DS12 prep failed: %d (continuing)", ret);
		}

		tx4[0] = 0x44;
		tx4[1] = HUB_SENSOR_IDX_LIS2DS12;
		tx4[2] = 0x01;
		tx4[3] = 0x01; /* host-fed accel → Family 0x14 */
		LOG_DBG("Enabling accelerometer host-side feed (0x44 04 01 01)...");
		ret = max32664_i2c_transmit_retry(dev, tx4, sizeof(tx4), rx, 1, 250, 3);
		if (ret || rx[0] != MAX32664_STATUS_SUCCESS) {
			LOG_WRN("Host-side accel enable failed: ret=%d, status=0x%02X",
				ret, rx[0]);
		} else {
			LOG_INF("Accelerometer host-side feed enabled (status=0x%02x)", rx[0]);
		}
		data->accel_enabled = (ret == 0 && rx[0] == MAX32664_STATUS_SUCCESS);
		k_msleep(50);
	} else {
		tx4[0] = 0x44;
		tx4[1] = HUB_SENSOR_IDX_LIS2DS12;
		tx4[2] = 0x01;
		tx4[3] = 0x00; /* hub auto-polls KX122 / internal bus */
		LOG_DBG("Enabling accelerometer hub-side (0x44 04 01 00)...");
		ret = max32664_i2c_transmit_retry(dev, tx4, sizeof(tx4), rx, 1, 100, 3);
		if (ret || rx[0] != MAX32664_STATUS_SUCCESS) {
			LOG_WRN("Hub-side accel enable failed: ret=%d, status=0x%02X",
				ret, rx[0]);
		}
		data->accel_enabled = (ret == 0 && rx[0] == MAX32664_STATUS_SUCCESS);
		k_msleep(50);
	}

	/* Configure MAX86141 for RAW mode sampling */
	ret = max32664_raw_configure_ppg(dev);
	if (ret) {
		LOG_ERR("Failed to configure MAX86141: %d", ret);
		return ret;
	}

	/* Configure LIS2DS12 for continuous sampling */
	ret = max32664_raw_configure_accel(dev);
	if (ret) {
		LOG_WRN("Failed to configure LIS2DS12: %d (continuing without accel)", ret);
	}

	/*
	 * No LED bring-up at init. Keep AFE dark (PA=0 + SHDN) until measurement
	 * start (attr_set SAMPLING_FREQUENCY). RAW is sensor-only — WHRM stays off.
	 */
	(void)max86141_ppg_leds_set(dev, false, &data->raw_runtime.leds_enabled);
	(void)max86141_write_reg(dev, MAX86141_REG_SYSTEM_CTRL, 0x02); /* SHDN */
	LOG_INF("RAW: LEDs idle/off; host LED bring-up deferred to measurement start");

	/* NOTE: Output mode is set to SENSOR_DATA (0x01) in max32664_post_init_setup().
	 * This tells the hub to actively read sensor FIFOs and populate its output FIFO.
	 * We read the output FIFO via Family 0x12 in max32664_raw_read_ppg_ex(). */

	LOG_INF("=== RAW Mode Initialization Complete ===");
	LOG_INF("Use max86141_ppg and lis2ds12_accel sensor devices");

	return 0;
}

/**
 * @brief Configure MAX86141 for RAW mode PPG sampling
 */
int max32664_raw_configure_ppg(const struct device *dev)
{
	struct max32664_data *data = dev->data;
	int ret;
	uint8_t val;

	LOG_INF("Configuring MAX86141 for RAW mode...");

	/* First, read current SYSTEM_CTRL to see if in shutdown */
	ret = max86141_read_reg(dev, MAX86141_REG_SYSTEM_CTRL, &val);
	if (ret) {
		LOG_ERR("Read SYSTEM_CTRL failed: %d", ret);
		/* Continue — subsequent writes still attempt a known-good map.
		 * WHRM/AEC is not used in sensor-only RAW (Track B). */
	}
	/*
	 * PPG_CONFIG1: ALC on, PPG2_RGE=01, PPG1_RGE=10, PPG_TINT=10 (58.7 µs).
	 * Sample rate is PPG_CONFIG2; LED count is LED_SEQ (not this register).
	 */
	ret = max86141_write_reg(dev, MAX86141_REG_PPG_CONFIG1, 0x1A);
	if (ret) {
		LOG_ERR("Write PPG_CONFIG1 failed: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 PPG_CONFIG1 configured: 0x1A (TINT=58.7us)");

	/* PPG_CONFIG2: No sample averaging (SMP_AVG=0) -> FIFO output = ADC rate (25 Hz).
	 * 8x averaging (0x03) was previously used but reduced the FIFO output to 3.125 Hz,
	 * causing a 300-sample measurement to take ~96 s instead of 12 s. */
	ret = max86141_write_reg(dev, MAX86141_REG_PPG_CONFIG2, 0x00);
	if (ret) {
		LOG_ERR("Write PPG_CONFIG2 failed: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 PPG_CONFIG2 configured: ~25 Hz, no averaging");

	/*
	 * SFH7074 LED map: LED1=Green, LED2=Red, LED3=IR.
	 * LEDC1=LED3(IR), LEDC2=LED2(Red), LEDC3=LED1(Green), LEDC4=DIRECT_AMBIENT.
	 * RAW ignores DT child LED currents — host AGC owns PA (max86141_ppg_set_led_pa).
	 */
	ret = max86141_write_reg(dev, MAX86141_REG_LED_SEQ1, MAX86141_LED_SEQ1_PRODUCT);
	if (ret) {
		LOG_ERR("Write LED_SEQ1 failed: %d", ret);
		return ret;
	}
	ret = max86141_write_reg(dev, MAX86141_REG_LED_SEQ2, MAX86141_LED_SEQ2_PRODUCT);
	if (ret) {
		LOG_ERR("Write LED_SEQ2 failed: %d", ret);
		return ret;
	}
	ret = max86141_write_reg(dev, MAX86141_REG_LED_SEQ3, MAX86141_LED_SEQ3_PRODUCT);
	if (ret) {
		LOG_ERR("Write LED_SEQ3 failed: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 LED_SEQ: IR→Red→Green→Ambient (SFH7074)");

	/* LED_RANGE1: each RGE=01 → 62 mA full-scale. */
	ret = max86141_write_reg(dev, MAX86141_REG_LED_RANGE1, MAX86141_LED_RANGE1_62MA);
	if (ret) {
		LOG_ERR("Write LED_RANGE1 failed: %d", ret);
		return ret;
	}
	ret = max86141_write_reg(dev, MAX86141_REG_LED_RANGE2, 0x01);
	if (ret) {
		LOG_ERR("Write LED_RANGE2 failed: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 LED_RANGE1=0x%02X (62 mA FS x3)",
		MAX86141_LED_RANGE1_62MA);

	/* Dual PD bias: SFH PD1→PD1IN, SFH PD3→PD2IN. */
	ret = max86141_write_reg(dev, MAX86141_REG_PD_CONFIG,
				 MAX86141_PD_CONFIG_SFH7074_DUAL);
	if (ret) {
		LOG_ERR("Write PD_CONFIG failed: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 PD_CONFIG=0x%02X (SFH7074 dual PD bias)",
		MAX86141_PD_CONFIG_SFH7074_DUAL);

