DMSurya/Nisense_Surya/NiSense-main/drivers/sensor/max32664/max32664_raw.c
	/*
	 * Program PA=0 here. Measurement start / drain assert PA=0x7F (~half of
	 * 62 mA FS) via max86141_ppg_leds_set(true). Leaving PA high across init
	 * would leave LEDs glowing until host start.
	 */
	ret = max86141_write_reg(dev, MAX86141_REG_LED1_DRV_CUR, 0x00);
	if (ret) {
		LOG_ERR("Write LED1_PA failed: %d", ret);
		return ret;
	}
	data->raw_runtime.leds_enabled = false;

	ret = max86141_write_reg(dev, MAX86141_REG_LED2_DRV_CUR, 0x00);
	if (ret) {
		LOG_ERR("Write LED2_PA failed: %d", ret);
		return ret;
	}

	ret = max86141_write_reg(dev, MAX86141_REG_LED3_DRV_CUR, 0x00);
	if (ret) {
		LOG_ERR("Write LED3_PA failed: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 LED1/LED2/LED3 PA idle (0); drive on at measurement start");

	/* Leave AFE in shutdown — LEDs stay dark until measurement start. */
	ret = max86141_write_reg(dev, MAX86141_REG_SYSTEM_CTRL, 0x02);
	if (ret) {
		LOG_ERR("Failed to shutdown MAX86141: %d", ret);
		return ret;
	}
	LOG_DBG("MAX86141 left in SHDN (LEDs off until measure)");
	k_msleep(10);

	/* Read back key registers to verify */
	ret = max86141_read_reg(dev, MAX86141_REG_SYSTEM_CTRL, &val);
	LOG_DBG("MAX86141 SYSTEM_CTRL after config: 0x%02X (expect 0x02 SHDN)", val);
	
	ret = max86141_read_reg(dev, MAX86141_REG_PPG_CONFIG1, &val);
	LOG_DBG("MAX86141 PPG_CONFIG1: 0x%02X (expect 0x1A)", val);
	
	ret = max86141_read_reg(dev, MAX86141_REG_LED_SEQ1, &val);
	LOG_DBG("MAX86141 LED_SEQ1: 0x%02X (expect 0x%02X)", val,
		MAX86141_LED_SEQ1_PRODUCT);
	
	ret = max86141_read_reg(dev, MAX86141_REG_LED2_DRV_CUR, &val);
	LOG_DBG("MAX86141 LED2_DRV_CUR: 0x%02X (expect 0x00 idle)", val);

	ret = max86141_read_reg(dev, MAX86141_REG_LED3_DRV_CUR, &val);
	LOG_DBG("MAX86141 LED3_DRV_CUR: 0x%02X (expect 0x00 idle)", val);

	ret = max86141_read_reg(dev, MAX86141_REG_LED_SEQ2, &val);
	LOG_DBG("MAX86141 LED_SEQ2: 0x%02X (expect 0x%02X, LEDC3=Green)", val,
		MAX86141_LED_SEQ2_PRODUCT);

	ret = max86141_read_reg(dev, MAX86141_REG_LED1_DRV_CUR, &val);
	LOG_DBG("MAX86141 LED1_DRV_CUR: 0x%02X (expect 0x00 idle)", val);

	ret = max86141_read_reg(dev, MAX86141_REG_LED_RANGE1, &val);
	LOG_DBG("MAX86141 LED_RANGE1: 0x%02X (expect 0x%02X)", val,
		MAX86141_LED_RANGE1_62MA);

	ret = max86141_read_reg(dev, MAX86141_REG_LED_RANGE2, &val);
	LOG_DBG("MAX86141 LED_RANGE2: 0x%02X (expect 0x01)", val);

	ret = max86141_read_reg(dev, MAX86141_REG_PD_CONFIG, &val);
	LOG_DBG("MAX86141 PD_CONFIG: 0x%02X (expect 0x%02X)", val,
		MAX86141_PD_CONFIG_SFH7074_DUAL);

	ret = max86141_read_reg(dev, MAX86141_REG_INT_STATUS1, &val);
	LOG_DBG("MAX86141 INT_STATUS1: 0x%02X", val);

	LOG_INF("MAX86141 configured: 25Hz IR/Red/Green/Ambient SEQ, dual-PD bias, PA=0, SHDN");
	return 0;
}

/**
 * @brief Configure LIS2DS12 for RAW mode acceleration sampling
 */
int max32664_raw_configure_accel(const struct device *dev)
{
	int ret;

	LOG_INF("Configuring LIS2DS12 for RAW mode...");

	/* Verify WHOAMI first */
	uint8_t whoami;
	ret = lis2ds12_read_reg(dev, LIS2DS12_REG_WHO_AM_I, &whoami);
	if (ret || (whoami != 0x43 && whoami != 0x1D)) {
		LOG_ERR("LIS2DS12 WHOAMI failed: ret=%d, whoami=0x%02X", ret, whoami);
		return ret ? ret : -ENODEV;
	}
	LOG_DBG("LIS2DS12 detected: WHOAMI=0x%02X", whoami);

	/* CTRL1: 25 Hz, ±2 g, BDU=1 (same encoding as host-feed / max32664c) */
	uint8_t ctrl1 = (LIS2DS12_ODR_25HZ << LIS2DS12_ODR_POS) |
		       (LIS2DS12_FS_2G << LIS2DS12_FS_POS) |
		       (1U << LIS2DS12_BDU_POS);

	ret = lis2ds12_write_reg(dev, LIS2DS12_REG_CTRL1, ctrl1);
	if (ret) return ret;
	LOG_DBG("LIS2DS12 CTRL1 configured: 25Hz, ±2g, BDU=1");

	/* CTRL2: Defaults (no filters) */
	ret = lis2ds12_write_reg(dev, LIS2DS12_REG_CTRL2, 0x00);
	if (ret) return ret;
	LOG_DBG("LIS2DS12 CTRL2 configured: default");

	LOG_INF("LIS2DS12 configured: 25Hz, ±2g");
	return 0;
}

/* ============================================================================
 * RAW Mode PPG Data Access
 * ============================================================================ */

static int max32664_raw_read_ppg_via_afe_fifo(const struct device *dev,
					      uint32_t *ir_value,
					      uint32_t *red_value,
					      uint32_t *green_value)
{
	uint8_t cnt;
	int ret;
	int drained = 0;
	uint32_t ir = 0;
	uint32_t red = 0;

	ret = max86141_read_reg(dev, MAX86141_REG_FIFO_DATA_CNT, &cnt);
	if (ret) {
		return ret;
	}

	if (cnt < 6U) {
		return 0;
	}

	while (cnt >= 6U && drained < 48) {
		uint8_t raw[6];

		ret = max86141_read_fifo_burst(dev, raw, sizeof(raw));
		if (ret) {
			return ret;
		}

		/* Product SEQ: LEDC1=IR(LED3), LEDC2=Red(LED2), LEDC3=Green(LED1). */
		ir = ((uint32_t)raw[0] << 16) | ((uint32_t)raw[1] << 8) | raw[2];
		ir &= 0x7FFFFU;
		red = ((uint32_t)raw[3] << 16) | ((uint32_t)raw[4] << 8) | raw[5];
		red &= 0x7FFFFU;
		drained++;

		ret = max86141_read_reg(dev, MAX86141_REG_FIFO_DATA_CNT, &cnt);
		if (ret) {
			return ret;
		}
	}

	*ir_value = ir;
	*red_value = red;
	/* AFE direct FIFO path only reads 2 slots (6 bytes) — green not yet burst-parsed here */
	if (green_value) {
		*green_value = 0;
	}

	return 1;
}

/**
 * @brief Drain the hub output FIFO into @p out (up to @p out_cap samples).
 *
 * Performs one FIFO count query, pops every pending frame (discarding settle
 * and invalid entries), and returns all valid IR/Red/Green triplets. Call
 * repeatedly until 0 is returned to empty the hub FIFO — matches max3010x_ppg
 * batching.
 *
 * @param dev MAX32664 device
 * @param out Output sample array
 * @param out_cap Capacity of @p out
 * @return Number of samples written (0 if empty), or negative errno
 */
int max32664_raw_drain_ppg(const struct device *dev,
			   struct max32664_ppg_sample *out,
			   size_t out_cap)
{
	int ret;
	struct max32664_data *hub_data = dev->data;
	struct max32664_raw_runtime *rt = &hub_data->raw_runtime;
	uint8_t tx_buf[2];
	uint8_t remaining = 0xFF;
	int rem_ret = -EAGAIN;
	bool fifo_drained = false;
	const uint32_t max_valid_adc = CONFIG_MAX32664_RAW_MAX_VALID_ADC;
	const uint32_t near_sat_adc = CONFIG_MAX32664_RAW_NEAR_SAT_ADC;
	size_t n_out = 0U;

	if (out_cap == 0U) {
		return 0;
	}

	hub_data->sample.fifo_accel_valid = false;

