DMSurya/Nisense_Surya/NiSense-main/drivers/sensor/max32664/max32664_raw.c
	/*
	 * Never resurrect SFH LEDs after STOP. A late ppg_algo fetch / in-flight
	 * poll_work used to hit this PA restore after attr_set(0) had already
	 * cleared leds_enabled + SHDN — LEDs kept blinking past session end.
	 */
	if (!hub_data->sampling) {
		return 0;
	}

	/*
	 * Conditional PA restore (sensor-only RAW: host owns LED_PA).
	 * Only reassert when runtime flag is clear or IR PA readback is 0 —
	 * avoids per-drain I2C while recovering from hub glitches.
	 */
	{
		uint8_t ir_pa = 0U;
		bool need_restore = !rt->leds_enabled;

		if (!need_restore) {
			if (max86141_read_reg(dev, MAX86141_REG_LED3_DRV_CUR, &ir_pa) != 0 ||
			    ir_pa == 0U) {
				need_restore = true;
			}
		}
		if (need_restore) {
			(void)max86141_ppg_leds_set(dev, true, &rt->leds_enabled);
		}
	}

	if (rt->use_afe_fifo_fallback) {
		uint32_t ir = 0U;
		uint32_t red = 0U;
		uint32_t green = 0U;

		ret = max32664_raw_read_ppg_via_afe_fifo(dev, &ir, &red, &green);
		if (ret < 0) {
			LOG_ERR("RAW fallback AFE FIFO read failed: %d", ret);
			return ret;
		}
		if (ret == 0) {
			return 0;
		}
		if (rt->settle_discard_left > 0U) {
			rt->settle_discard_left--;
			rt->settle_discarded++;
			if (rt->settle_discarded == 1U) {
				LOG_INF("RAW settle: discarding first %u FIFO frames after LED wake",
					(unsigned int)CONFIG_MAX32664_RAW_SETTLE_DISCARD_SAMPLES);
			}
			if (rt->settle_discard_left == 0U) {
				LOG_INF("RAW settle complete (%u frames discarded); accepting samples",
					rt->settle_discarded);
			}
			return 0;
		}
		out[0].ir = ir;
		out[0].red = red;
		out[0].green = green;
		return 1;
	}

	size_t payload_bytes = 0U;

	if (rt->sensor_report_bytes == 0U) {
		uint8_t fw_major = (hub_data->firmware_version >> 16) & 0xFF;
		uint8_t fw_minor = (hub_data->firmware_version >> 8) & 0xFF;
		uint8_t fw_patch = hub_data->firmware_version & 0xFF;

		if (fw_major == 30U && fw_minor == 2U && fw_patch == 2U) {
			rt->sensor_report_bytes = 24U;
			LOG_INF("RAW sensor report size query skipped on FW 30.2.2; using %u bytes/sample",
				rt->sensor_report_bytes);
		} else {
			uint8_t size_tx[2] = {0x11, 0x05};
			uint8_t size_rx[2] = {0};

			ret = max32664_i2c_transmit_retry(dev, size_tx, sizeof(size_tx),
							  size_rx, sizeof(size_rx),
							  10, 3);
			if ((ret == 0) && (size_rx[0] == 0x00) &&
			    (size_rx[1] >= 6U) && (size_rx[1] <= 64U)) {
				rt->sensor_report_bytes = size_rx[1];
				LOG_INF("RAW sensor report size from hub: %u bytes/sample (0x11,0x05)",
					rt->sensor_report_bytes);
			} else {
				rt->sensor_report_bytes = 24U;
				LOG_WRN("RAW sensor report size query failed (ret=%d st=0x%02x sz=%u); using fallback=%u",
					ret, size_rx[0], size_rx[1], rt->sensor_report_bytes);
			}
		}
	}

	payload_bytes = rt->sensor_report_bytes;
	if (hub_data->fifo_entry_size_runtime > 0U) {
		payload_bytes = hub_data->fifo_entry_size_runtime;
	}

	if (payload_bytes > 64U) {
		LOG_WRN("RAW FIFO payload %zu capped to 64", payload_bytes);
		payload_bytes = 64U;
	}

	if (!rt->payload_logged) {
		LOG_INF("RAW hub FIFO: %zu data bytes/sample (+1 status) (variant=%d)",
			payload_bytes, hub_data->variant);
		rt->payload_logged = true;
	}

	uint8_t count_resp[2];

	tx_buf[0] = 0x12;
	tx_buf[1] = 0x00;
	ret = max32664_i2c_transmit(dev, tx_buf, 2, count_resp, 2, MAX32664_CMD_DELAY_FIFO_MS);
	if (ret) {
		LOG_ERR("Hub FIFO query failed: %d", ret);
		return ret;
	}

	uint8_t num_samples = count_resp[1];

	rt->read_count++;

	if (num_samples == 0U) {
		if (rt->read_count <= CONFIG_MAX32664_RAW_FIFO_LOG_INITIAL_READS ||
		    (rt->read_count % CONFIG_MAX32664_RAW_FIFO_LOG_EVERY_N_READS) == 0U) {
			LOG_DBG("Hub FIFO empty (read #%u)", rt->read_count);
		}
		return 0;
	}

	const bool log_summary_now =
		(rt->read_count <= CONFIG_MAX32664_RAW_FIFO_LOG_INITIAL_READS) ||
		((rt->read_count % CONFIG_MAX32664_RAW_FIFO_LOG_EVERY_N_READS) == 0U);
	const bool log_dump_now =
		IS_ENABLED(CONFIG_MAX32664_RAW_FIFO_DEBUG_DUMP) &&
		((rt->read_count <= CONFIG_MAX32664_RAW_FIFO_DEBUG_DUMP_INITIAL_READS) ||
		 ((rt->read_count % CONFIG_MAX32664_RAW_FIFO_DEBUG_DUMP_EVERY_N_READS) == 0U));

	const size_t read_size = payload_bytes + 1U;
	uint8_t sample_data[65];
	uint8_t read_cmd2[2] = {0x12, 0x01};
	uint8_t read_cmd3[3] = {0x12, 0x01, 0x01};
	uint8_t *read_cmd = rt->use_fifo_read_count_arg ? read_cmd3 : read_cmd2;
	const size_t read_cmd_len = rt->use_fifo_read_count_arg ? sizeof(read_cmd3) : sizeof(read_cmd2);

	if (read_size < 7U || payload_bytes < 6U) {
		rt->rejected_count++;
		LOG_WRN("RAW frame too short (payload=%zu read_size=%zu), skipping batch",
			payload_bytes, read_size);
		return 0;
	}

	uint32_t last_ir = 0U;
	uint32_t last_red = 0U;
	uint32_t last_green = 0U;
	uint32_t last_ambient = 0U;

	for (uint8_t s = 0; s < num_samples; s++) {
		uint32_t led1 = 0U;
		uint32_t led2 = 0U;
		uint32_t led3 = 0U;
		uint32_t led4 = 0U;
		uint8_t led1_meta = 0U;
		uint8_t led2_meta = 0U;
		uint8_t led3_meta = 0U;
		uint8_t led4_meta = 0U;
		int16_t ax = 0;
		int16_t ay = 0;
		int16_t az = 0;
		bool accel_valid = false;

		ret = max32664_i2c_transmit(dev, read_cmd, read_cmd_len,
					    sample_data, read_size,
					    MAX32664_CMD_DELAY_FIFO_MS);
		if (ret) {
			LOG_ERR("Hub FIFO read failed (sample %u/%u): %d",
				s + 1, num_samples, ret);
			return (n_out > 0U) ? (int)n_out : ret;
		}

		if (payload_bytes >= 3U) {
			uint32_t led1_word = ((uint32_t)sample_data[1] << 16) |
					     ((uint32_t)sample_data[2] << 8) |
					     (uint32_t)sample_data[3];

			led1 = led1_word & 0x7FFFFU;
			led1_meta = (uint8_t)((led1_word >> 19) & 0x1FU);
		}
		if (payload_bytes >= 6U) {
			uint32_t led2_word = ((uint32_t)sample_data[4] << 16) |
					     ((uint32_t)sample_data[5] << 8) |
					     (uint32_t)sample_data[6];

			led2 = led2_word & 0x7FFFFU;
			led2_meta = (uint8_t)((led2_word >> 19) & 0x1FU);
		}
		if (payload_bytes >= 9U) {
			uint32_t led3_word = ((uint32_t)sample_data[7] << 16) |
					     ((uint32_t)sample_data[8] << 8) |
					     (uint32_t)sample_data[9];

			led3 = led3_word & 0x7FFFFU;
			led3_meta = (uint8_t)((led3_word >> 19) & 0x1FU);
		}
		if (payload_bytes >= 12U) {
			uint32_t led4_word = ((uint32_t)sample_data[10] << 16) |
					     ((uint32_t)sample_data[11] << 8) |
					     (uint32_t)sample_data[12];

			led4 = led4_word & 0x7FFFFU;
			led4_meta = (uint8_t)((led4_word >> 19) & 0x1FU);
		}

		uint32_t ir = led1;
		uint32_t red = led2;
		uint32_t green_raw = led3;
		/* Hub may still present a 4th word; product SEQ now includes
		 * DIRECT_AMBIENT so this is a real ambient exposure. */
		uint32_t ambient = max86141_green_sanitize_adc(led4);

