DMSurya/Nisense_Surya/NiSense-main/drivers/sensor/max32664/max32664_raw.c
		/*
		 * Post-LED-wake settle: drop early frames so SHDN/PA exit and
		 * stale FIFO never reach the algo (see Kconfig settle discard).
		 */
		if (rt->settle_discard_left > 0U) {
			rt->settle_discard_left--;
			rt->settle_discarded++;
			if (rt->settle_discarded == 1U) {
				LOG_INF("RAW settle: discarding first %u FIFO frames after LED wake",
					(unsigned int)CONFIG_MAX32664_RAW_SETTLE_DISCARD_SAMPLES);
			}
			if (rt->settle_discard_left == 0U) {
				LOG_INF("RAW settle complete (%u frames discarded); accepting samples",
					rt->settle_discarded);
			}
			continue;
		}

		if (payload_bytes >= 24U) {
			ax = (int16_t)(((uint16_t)sample_data[19] << 8) |
				       (uint16_t)sample_data[20]);
			ay = (int16_t)(((uint16_t)sample_data[21] << 8) |
				       (uint16_t)sample_data[22]);
			az = (int16_t)(((uint16_t)sample_data[23] << 8) |
				       (uint16_t)sample_data[24]);
			accel_valid = true;
		}

		uint32_t green = max86141_green_sanitize_adc(green_raw);

		/*
		 * Hold last good green across true hub fillers (0x7FFFF) when
		 * IR/Red show contact. Zeroing those gaps kills HR/Hb.
		 */
		if ((green == 0U) && (last_green > 0U) &&
		    (ir > 50000U) && (red > 50000U)) {
			green = last_green;
		}

		last_ir = ir;
		last_red = red;
		last_green = green;
		last_ambient = ambient;

		if (log_dump_now) {
			LOG_DBG("RAW FIFO pop %u/%u (read #%u): IR=%u Red=%u Grn=%u Amb=%u | Acc=%s(%d,%d,%d)",
				s + 1U, num_samples, rt->read_count,
				ir, red, green, ambient,
				accel_valid ? "" : "N/A ",
				accel_valid ? ax : 0,
				accel_valid ? ay : 0,
				accel_valid ? az : 0);
			LOG_DBG("RAW FIFO meta %u/%u: L1=0x%02x L2=0x%02x L3=0x%02x L4=0x%02x LED=%u/%u/%u/%u",
				s + 1U, num_samples,
				led1_meta, led2_meta, led3_meta, led4_meta,
				led1, led2, led3, led4);
		}

		if ((ir == 0U) || (red == 0U) ||
		    (ir > max_valid_adc) || (red > max_valid_adc) ||
		    (ir >= near_sat_adc) || (red >= near_sat_adc)) {
			rt->rejected_count++;
			if (rt->rejected_count <= 10U || (rt->rejected_count % 50U) == 0U) {
				LOG_WRN("RAW invalid sample rejected: IR=%u RED=%u (rej=%u)",
					ir, red, rt->rejected_count);
			}
			continue;
		}

		if (rt->prev_valid &&
		    (((ir < 1024U) && (rt->prev_ir > 50000U)) ||
		     ((red < 1024U) && (rt->prev_red > 50000U)))) {
			rt->rejected_count++;
			if (rt->rejected_count <= 10U || (rt->rejected_count % 50U) == 0U) {
				LOG_WRN("RAW reset-pattern sample rejected: prev=(%u,%u) now=(%u,%u)",
					rt->prev_ir, rt->prev_red, ir, red);
			}
			continue;
		}

		if (n_out < out_cap) {
			out[n_out].ir = ir;
			out[n_out].red = red;
			out[n_out].green = green;
			out[n_out].ambient = ambient;
			n_out++;
		}

		rt->prev_ir = ir;
		rt->prev_red = red;
		rt->prev_valid = true;
	}

	if (log_summary_now) {
		LOG_INF("Hub FIFO: popped %u, kept %zu/%zu valid (IR=%u Red=%u Grn=%u Amb=%u, read #%u)",
			num_samples, n_out, out_cap, last_ir, last_red, last_green, last_ambient,
			rt->read_count);
		if (log_dump_now && n_out > 0U) {
			LOG_HEXDUMP_DBG(&sample_data[1], payload_bytes, "Raw sensor data");
		}
	}

	rem_ret = max32664_get_fifo_count(dev, &remaining);
	fifo_drained = (rem_ret == 0) && (remaining < num_samples);

	if (fifo_drained) {
		rt->fifo_stagnant_reads = 0;
	} else if (rem_ret == 0) {
		if (rt->fifo_stagnant_reads < UINT8_MAX) {
			rt->fifo_stagnant_reads++;
		}
		if (!rt->use_fifo_read_count_arg && rt->fifo_stagnant_reads >= 3U) {
			rt->use_fifo_read_count_arg = true;
			LOG_WRN("RAW FIFO not draining with 2-byte read cmd; switching to 3-byte read cmd (0x12,0x01,0x01)");
		}
		if (rt->use_fifo_read_count_arg && rt->fifo_stagnant_reads >= 8U) {
			rt->use_afe_fifo_fallback = true;
			LOG_WRN("RAW hub FIFO remains non-draining; switching to direct MAX86141 FIFO read fallback");
		}
	}

	if ((rt->read_count <= 10U) || ((rt->read_count % 50U) == 0U)) {
		uint8_t hub_status = 0U;

		if (max32664_get_hub_status(dev, &hub_status) == 0) {
			bool err0 = false;
			bool data_rdy = false;
			bool fifo_out_ovr = false;
			bool fifo_in_ovr = false;
			bool host_accel_uf = false;

			max32664_parse_status(hub_status, &err0, &data_rdy,
					     &fifo_out_ovr, &fifo_in_ovr, &host_accel_uf);
			if (fifo_out_ovr || fifo_in_ovr || host_accel_uf || err0) {
				LOG_WRN("RAW hub status anomalies: 0x%02x (err=%d out_ovr=%d in_ovr=%d accel_uf=%d)",
					hub_status, err0, fifo_out_ovr, fifo_in_ovr, host_accel_uf);
			}
		}
	}

	return (int)n_out;
}

int max32664_raw_read_ppg_ex(const struct device *dev,
			     uint32_t *ir_value, uint32_t *red_value,
			     uint32_t *green_value)
{
	struct max32664_ppg_sample one;
	int n;

	n = max32664_raw_drain_ppg(dev, &one, 1U);
	if (n <= 0) {
		return n;
	}

	*ir_value = one.ir;
	*red_value = one.red;
	if (green_value) {
		*green_value = one.green;
	}
	return 1;
}

int max32664_raw_read_ppg(const struct device *dev,
			  uint32_t *ir_value, uint32_t *red_value)
{
	return max32664_raw_read_ppg_ex(dev, ir_value, red_value, NULL);
}

/* ============================================================================
 * RAW Mode Accelerometer Data Access
 * ============================================================================ */

/**
 * @brief Read acceleration from LIS2DS12
 *
 * @param dev MAX32664 device
 * @param x Pointer to store X acceleration (milli-g)
 * @param y Pointer to store Y acceleration (milli-g)
 * @param z Pointer to store Z acceleration (milli-g)
 * @return 0 on success, negative error code on failure
 */
int max32664_raw_read_accel(const struct device *dev,
			    int16_t *x, int16_t *y, int16_t *z)
{
	uint8_t data[6];
	int ret;

	/* Read all 6 output registers */
	for (int i = 0; i < 6; i++) {
		ret = lis2ds12_read_reg(dev, LIS2DS12_REG_OUT_X_L + i, &data[i]);
		if (ret) {
			LOG_ERR("Failed to read accel register %d: %d", i, ret);
			return ret;
		}
	}

	/* Convert to signed 16-bit (raw values) */
	int16_t raw_x = (int16_t)((data[1] << 8) | data[0]);
	int16_t raw_y = (int16_t)((data[3] << 8) | data[2]);
	int16_t raw_z = (int16_t)((data[5] << 8) | data[4]);

	/* Convert to milli-g at ±2g range (0.061 mg/LSB for 16-bit) */
	*x = (raw_x * 61) / 1000;
	*y = (raw_y * 61) / 1000;
	*z = (raw_z * 61) / 1000;

