DMSurya/Nisense_Surya/NiSense-main/drivers/sensor/max32664/max32664_raw.c
	return 0;
}

/* Host AGC: independent closed-loop targeting per LED channel.
 *
 * CORRECTED 2026-08-24: IR narrowed from 20000-420000 to actively target
 * the reference operating point (IR_DC~250000, per the SpO2~95.6%/
 * Hb~14g/dL worked example) instead of a very wide band that left IR
 * sitting at ~180-200k (below target) without ever triggering a
 * correction, since that already fell inside the old 20k-420k range.
 * LO/HI give a ±14-15% window around each target so the AGC doesn't
 * hunt/oscillate on every small fluctuation.
 *
 * EXTENDED: Red and Green now get their own DC bands and are driven by
 * their own independently-tracked PA (max86141_ppg_get/set_led_pa_red()/
 * _green()) instead of being a fixed fraction of IR's current. That old
 * scheme could only ever be "correct" if the subject's actual per-channel
 * perfusion index happened to match whatever single session the fraction
 * was hand-tuned from — it had no way to correct itself.
 *
 * AC is tracked against the same reference point (IR_AC~2000, Red_AC~
 * 1200, Green_AC~500) but treated as a secondary/diagnostic signal, not
 * a second target PA can always hit: R = (AC/DC) is, in the ideal linear
 * region, mostly current-independent (see red_pa_from() comment above) —
 * it's a property of tissue perfusion and optical coupling. If DC is
 * already inside its band and AC is still outside its band, that's a
 * real perfusion-index mismatch for this subject/contact, not something
 * more or less LED current can fix without pushing DC out of its own
 * safe window. This is logged clearly instead of silently forcing PA
 * outside the DC-safe range chasing a number current can't control.
 */
#define RAW_AGC_DC_LO         215000U
#define RAW_AGC_DC_HI         285000U
#define RAW_AGC_RED_DC_LO     221000U
#define RAW_AGC_RED_DC_HI     299000U
#define RAW_AGC_GREEN_DC_LO   229500U
#define RAW_AGC_GREEN_DC_HI   310500U
#define RAW_AGC_AC_IR_LO      1300U
#define RAW_AGC_AC_IR_HI      2700U
#define RAW_AGC_AC_RED_LO      780U
#define RAW_AGC_AC_RED_HI     1620U
#define RAW_AGC_AC_GREEN_LO    325U
#define RAW_AGC_AC_GREEN_HI    675U
#define RAW_AGC_STEP    0x10U

/* One channel's step-and-log logic, shared by IR/Red/Green so all three
 * behave identically apart from their target bands. DC is the primary,
 * safety-relevant target (keeps the ADC in a usable, non-saturating
 * range); AC is reported for visibility only — see block comment above
 * for why it isn't a second thing PA chases on its own. */
static uint8_t agc_step_channel(const char *name, uint32_t dc, uint32_t dc_lo, uint32_t dc_hi,
				 uint32_t ac, uint32_t ac_lo, uint32_t ac_hi, uint8_t pa)
{
	if (dc == 0U) {
		return pa;
	}

	if (dc < dc_lo && pa < MAX86141_LED_PA_MAX) {
		uint16_t next = (uint16_t)pa + RAW_AGC_STEP;

		if (next > MAX86141_LED_PA_MAX) {
			next = MAX86141_LED_PA_MAX;
		}
		pa = (uint8_t)next;
		LOG_INF("RAW AGC %s: DC=%u low -> PA=0x%02X", name, dc, pa);
	} else if (dc > dc_hi && pa > MAX86141_LED_PA_MIN) {
		int16_t next = (int16_t)pa - (int16_t)RAW_AGC_STEP;

		if (next < (int16_t)MAX86141_LED_PA_MIN) {
			next = (int16_t)MAX86141_LED_PA_MIN;
		}
		pa = (uint8_t)next;
		LOG_INF("RAW AGC %s: DC=%u high -> PA=0x%02X", name, dc, pa);
	} else if (ac != 0U && (ac < ac_lo || ac > ac_hi)) {
		LOG_WRN("RAW AGC %s: DC=%u in-band but AC=%u outside [%u,%u] — "
			"perfusion-index mismatch for this contact, not a PA problem",
			name, dc, ac, ac_lo, ac_hi);
	}

	return pa;
}

uint8_t max32664_raw_host_agc(const struct device *hub,
			       uint32_t dc_ir, uint32_t ac_ir,
			       uint32_t dc_red, uint32_t ac_red,
			       uint32_t dc_green, uint32_t ac_green)
{
	uint8_t ir_pa = max86141_ppg_get_led_pa();
	uint8_t red_pa = max86141_ppg_get_led_pa_red();
	uint8_t green_pa = max86141_ppg_get_led_pa_green();

	ARG_UNUSED(hub);

	ir_pa = agc_step_channel("IR", dc_ir, RAW_AGC_DC_LO, RAW_AGC_DC_HI,
				  ac_ir, RAW_AGC_AC_IR_LO, RAW_AGC_AC_IR_HI, ir_pa);
	max86141_ppg_set_led_pa(ir_pa);

	red_pa = agc_step_channel("RED", dc_red, RAW_AGC_RED_DC_LO, RAW_AGC_RED_DC_HI,
				   ac_red, RAW_AGC_AC_RED_LO, RAW_AGC_AC_RED_HI, red_pa);
	max86141_ppg_set_led_pa_red(red_pa);

	green_pa = agc_step_channel("GREEN", dc_green, RAW_AGC_GREEN_DC_LO, RAW_AGC_GREEN_DC_HI,
				     ac_green, RAW_AGC_AC_GREEN_LO, RAW_AGC_AC_GREEN_HI, green_pa);
	max86141_ppg_set_led_pa_green(green_pa);

	return ir_pa;
}

uint8_t max32664_raw_get_led_pa(void)
{
	return max86141_ppg_get_led_pa();
}

void max32664_raw_seed_led_pa_from_cal(void)
{
#if defined(CONFIG_CALIBRATION)
	const struct ppg_calibration *ppg = calibration_get_ppg();

	if (ppg == NULL) {
		return;
	}

	/* Prefer IR current; 62 mA FS → PA ≈ ua * 255 / 62000 */
	uint16_t ua = ppg->led_current_ir_ua;

	if (ua == 0U) {
		ua = ppg->led_current_red_ua;
	}
	if (ua == 0U) {
		return;
	}

	uint32_t pa = ((uint32_t)ua * 255U) / 62000U;

	if (pa < MAX86141_LED_PA_MIN) {
		pa = MAX86141_LED_PA_MIN;
	} else if (pa > MAX86141_LED_PA_MAX) {
		pa = MAX86141_LED_PA_MAX;
	}
	max86141_ppg_set_led_pa((uint8_t)pa);
	LOG_INF("RAW: seeded LED PA=0x%02X from factory %u uA", (uint8_t)pa, ua);
#endif
}

/* ============================================================================
 * Sensor API Registration (creates child devices in RAW mode)
 * ============================================================================ */

#ifdef CONFIG_MAX32664_RAW_PPG_SENSOR
/* Forward declaration - implemented in max86141_ppg.c */
extern const struct sensor_driver_api max86141_ppg_driver_api;
#endif

#ifdef CONFIG_MAX32664_RAW_ACCEL_SENSOR
/* Forward declaration - implemented in lis2ds12_accel.c */
extern const struct sensor_driver_api lis2ds12_accel_driver_api;
#endif
